Revit 2027 API
NumberingFormattedParameter.GetParameter Method
 Get the target parameter for formatting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumberingParameter GetParameter()
Public Function GetParameter As NumberingParameter
public:
NumberingParameter^ GetParameter()
member GetParameter : unit -> NumberingParameter
Return Value
NumberingParameter
See Also
Reference
NumberingFormattedParameter Class
Autodesk.Revit.DB Namespace